## Staging: database-tools
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 3 to add, 3 to change, 3 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.blazer_exection_role_parameter_policy_actions will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "blazer_exection_role_parameter_policy_actions"  {
      ~ id      = "1319026527" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ssmmessages:OpenDataChannel",
                          - "ssmmessages:OpenControlChannel",
                          - "ssmmessages:CreateDataChannel",
                          - "ssmmessages:CreateControlChannel",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ssm:GetParameters",
                          - "ssm:DescribeParameters",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ssm:ca-central-1:239043911459:parameter/sqlalchemy_database_reader_uri",
                          - "arn:aws:ssm:ca-central-1:239043911459:parameter/BLAZER_DATABASE_URL",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              - "arn:aws:ssm:ca-central-1:239043911459:parameter/BLAZER_DATABASE_URL",
              - "arn:aws:ssm:ca-central-1:239043911459:parameter/sqlalchemy_database_reader_uri",
              ~ (known after apply),
              ~ (known after apply),
            ]
            # (2 unchanged attributes hidden)
        }
    }

  # data.aws_iam_policy_document.blazer_task_role_actions will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "blazer_task_role_actions"  {
      ~ id      = "1319026527" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ssmmessages:OpenDataChannel",
                          - "ssmmessages:OpenControlChannel",
                          - "ssmmessages:CreateDataChannel",
                          - "ssmmessages:CreateControlChannel",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ssm:GetParameters",
                          - "ssm:DescribeParameters",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ssm:ca-central-1:239043911459:parameter/sqlalchemy_database_reader_uri",
                          - "arn:aws:ssm:ca-central-1:239043911459:parameter/BLAZER_DATABASE_URL",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              - "arn:aws:ssm:ca-central-1:239043911459:parameter/BLAZER_DATABASE_URL",
              - "arn:aws:ssm:ca-central-1:239043911459:parameter/sqlalchemy_database_reader_uri",
              ~ (known after apply),
              ~ (known after apply),
            ]
            # (2 unchanged attributes hidden)
        }
    }

  # aws_ecs_service.blazer will be updated in-place
  ~ resource "aws_ecs_service" "blazer" {
        id                                 = "arn:aws:ecs:ca-central-1:239043911459:service/blazer/blazer"
        name                               = "blazer"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:239043911459:task-definition/blazer:5" -> (known after apply)
        # (14 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.blazer must be replaced
-/+ resource "aws_ecs_task_definition" "blazer" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:239043911459:task-definition/blazer:5" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = []
                  - essential        = true
                  - image            = "ankane/blazer:v2.6.5"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "blazer"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "blazer"
                        }
                    }
                  - mountPoints      = []
                  - name             = "blazer"
                  - portMappings     = [
                      - {
                          - containerPort = 8080
                          - hostPort      = 8080
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "DATABASE_URL"
                          - valueFrom = "arn:aws:ssm:ca-central-1:239043911459:parameter/sqlalchemy_database_reader_uri"
                        },
                      - {
                          - name      = "BLAZER_DATABASE_URL"
                          - valueFrom = "arn:aws:ssm:ca-central-1:239043911459:parameter/BLAZER_DATABASE_URL"
                        },
                    ]
                  - volumesFrom      = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ id                       = "blazer" -> (known after apply)
      ~ revision                 = 5 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # aws_iam_policy.blazer_exection_role_parameter_policy will be updated in-place
  ~ resource "aws_iam_policy" "blazer_exection_role_parameter_policy" {
        id        = "arn:aws:iam::239043911459:policy/blazer_exection_role_parameter_policy"
        name      = "blazer_exection_role_parameter_policy"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ssmmessages:OpenDataChannel",
                          - "ssmmessages:OpenControlChannel",
                          - "ssmmessages:CreateDataChannel",
                          - "ssmmessages:CreateControlChannel",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ssm:GetParameters",
                          - "ssm:DescribeParameters",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ssm:ca-central-1:239043911459:parameter/sqlalchemy_database_reader_uri",
                          - "arn:aws:ssm:ca-central-1:239043911459:parameter/BLAZER_DATABASE_URL",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # aws_iam_policy.blazer_task_role_policy will be updated in-place
  ~ resource "aws_iam_policy" "blazer_task_role_policy" {
        id        = "arn:aws:iam::239043911459:policy/blazer_task_role_policy"
        name      = "blazer_task_role_policy"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ssmmessages:OpenDataChannel",
                          - "ssmmessages:OpenControlChannel",
                          - "ssmmessages:CreateDataChannel",
                          - "ssmmessages:CreateControlChannel",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ssm:GetParameters",
                          - "ssm:DescribeParameters",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ssm:ca-central-1:239043911459:parameter/sqlalchemy_database_reader_uri",
                          - "arn:aws:ssm:ca-central-1:239043911459:parameter/BLAZER_DATABASE_URL",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # aws_ssm_parameter.db_tools_environment_variables must be replaced
-/+ resource "aws_ssm_parameter" "db_tools_environment_variables" {
      - allowed_pattern = "" -> null
      ~ arn             = "arn:aws:ssm:ca-central-1:239043911459:parameter/BLAZER_DATABASE_URL" -> (known after apply)
      ~ data_type       = "text" -> (known after apply)
      - description     = "" -> null
      ~ id              = "BLAZER_DATABASE_URL" -> (known after apply)
      ~ key_id          = "alias/aws/ssm" -> (known after apply)
      ~ name            = "BLAZER_DATABASE_URL" -> "DATABASE_TOOLS_URL" # forces replacement
        tags            = {
            "CostCenter" = "notification-canada-ca-staging"
            "Terraform"  = "true"
        }
      ~ version         = 3 -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_ssm_parameter.sqlalchemy_database_reader_uri must be replaced
-/+ resource "aws_ssm_parameter" "sqlalchemy_database_reader_uri" {
      - allowed_pattern = "" -> null
      ~ arn             = "arn:aws:ssm:ca-central-1:239043911459:parameter/sqlalchemy_database_reader_uri" -> (known after apply)
      ~ data_type       = "text" -> (known after apply)
      - description     = "" -> null
      ~ id              = "sqlalchemy_database_reader_uri" -> (known after apply)
      ~ key_id          = "alias/aws/ssm" -> (known after apply)
      ~ name            = "sqlalchemy_database_reader_uri" -> "NOTIFICATION_DB_READ_URL" # forces replacement
        tags            = {
            "CostCenter" = "notification-canada-ca-staging"
            "Terraform"  = "true"
        }
      ~ version         = 3 -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 3 to add, 3 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>